app/Models/ProductModel.php

SELECT `id_producto`, `producto`
FROM `productos`
WHERE `producto` LIKE '%hue%' ESCAPE '!'
---
    function search($param){
        $builder = $this->getBuilder();
        $results = $builder
                        ->select('id_producto, producto, precio1, grupo, costo')
                        ->like('producto', $param)
                        ->get()
                        ->getResult();